<template>
  <div>
    <v-main>
      <v-container>
<h4>นโยบายความเป็นส่วนตัวสำหรับลูกค้า</h4>
บริษัท บีแทสก์ คอนซัลติ้ง จำกัด (ต่อไปนี้เรียกว่า "เรา") เคารพสิทธิความเป็นส่วนตัวของลูกค้า (ต่อไปนี้เรียกว่า "ท่าน") และเพื่อให้เกิดความมั่นใจว่าท่านได้รับความคุ้มครองข้อมูลส่วนบุคคล จึงได้จัดทำนโยบายความเป็นส่วนตัวฉบับนี้ขึ้น เพื่อแจ้งให้ทราบถึงรายละเอียดที่เกี่ยวข้องกับการเก็บรวบรวม การใช้ และการเปิดเผย (รวมเรียกว่า "การประมวลผล") รวมตลอดถึงการลบและทำลาย ข้อมูลส่วนบุคคลของท่านทั้งช่องทางออนไลน์ และช่องทางอื่น ๆ ตามที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลกำหนด ดังนี้
<br><br>
<h4>1. วัตถุประสงค์การประมวลผลข้อมูลส่วนบุคคล</h4>
1.1 เพื่อใช้ในการดำเนินการตามคำขอของท่านก่อนเข้าทำสัญญาหรือเพื่อปฏิบัติตามสัญญาซึ่งท่านเป็นคู่สัญญากับเรา เช่น เพื่อการเก็บคะแนน และ/หรือ บริการให้แก่ท่าน หรือปฏิบัติตามสัญญาใด ๆ ซึ่งท่านเป็นคู่สัญญา ซึ่งรวมถึง การจัดการบัญชีผู้ใช้ (Account) ของท่าน การจัดส่งสินค้า และดำเนินการใด ๆ เพื่อให้ท่านได้รับบริการ หรือตามที่ท่านได้ร้องขอ<br>
1.2 เพื่อประโยชน์โดยชอบด้วยกฎหมายของเราหรือของบุคคลอื่น<br>
(1) เพื่อให้เราสามารถจัดการ พัฒนา และดำเนินการใด ๆ เพื่อให้สามารถดำเนินธุรกิจได้ การบริหารจัดการและพัฒนาสินค้า และ/หรือ บริการ (รวมถึงเว็บไซต์ และแอปพลิเคชัน) การตรวจสอบและป้องกันการฉ้อโกง หรืออาชญากรรมอื่น ๆ การจัดการความสัมพันธ์ลูกค้าและผู้ที่อาจเป็นลูกค้า การบำรุงรักษาและการใช้ระบบไอที<br>
(2) เพื่อประโยชน์ทางด้านความปลอดภัย เช่น จัดให้มีมาตรการรักษาความปลอดภัย ซึ่งรวมถึงข้อมูลส่วนบุคคลของท่านด้วย เช่น การเข้าสู่ระบบ เข้าเว็บไซต์หรือแอปพลิเคชัน<br>
(3) เพื่อการใช้สิทธิเรียกร้องทางกฎหมาย<br>
1.3 เพื่อให้สามารถปฏิบัติตามกฎหมาย เช่น การปฏิบัติตามบทบัญญัติของกฎหมาย กฏระเบียบ และคำสั่งของผู้ที่มีอำนาจตามกฎหมาย<br>
1.4 กรณีที่ท่านให้ความยินยอมเราจะประมวลผลข้อมูลส่วนบุคคล<br>
(1) เพื่อให้เรา บริษัทในกลุ่มของเรา และพันธมิตร ส่งข่าวสารและสิทธิประโยชน์ผ่านทางอีเมล เอสเอ็มเอส แอปพลิเคชัน โซเชียลมีเดีย โทรศัพท์ และไดเร็กเมล<br>
(2) เพื่อให้เราดำเนินการจัดกิจกรรมนอกจากที่กล่าวมาข้างต้น โดยอาจเก็บข้อมูลส่วนบุคคลของท่านเพิ่มเติม โดยจะแจ้งให้ทราบและขอความยินยอมจากท่านใหม่เป็นคราว ๆ ไป<br>
ทั้งนี้ ท่านสามารถศึกษารายละเอียดเกี่ยวกับความยินยอมได้ในข้อ 4<br>
<br>
<h4>2. ข้อมูลส่วนบุคคลที่เก็บรวบรวม</h4>
2.1 เมื่อท่านจะใช้บริการ รวมทั้งการเข้าเป็นสมาชิกเว็บไซต์ แอปพลิเคชัน เราจะเก็บรวบรวมข้อมูลส่วนบุคคล ดังนี้<br>
(1) ข้อมูลส่วนตัว เช่น ชื่อบริษัท ชื่อ นามสกุล LINE ID ที่อยู่<br>
(2) ข้อมูลการติดต่อ เช่น เบอร์โทรศัพท์ อีเมล์ ที่อยู่ ช่องทางติดต่อในโซเชียลมีเดีย<br>
(3) ข้อมูลเกี่ยวกับการใช้บริการต่างๆ บนแอปพลิเคชัน เช่น ประวัติการนัดหมาย ประวัติการทำรายการต่างๆ<br>
2.2 เมื่อท่านเข้าใช้บริการ หรือเข้าชมเว็บไซต์หรือแอปพลิเคชัน เราจะเก็บรวบรวมข้อมูลส่วนบุคคล ดังนี้<br>
(1) ข้อมูลเกี่ยวกับการสมัครสมาชิก (Registration) เช่น ชื่อบริษัท เบอร์มือถือ อีเมล์ <br>
(2) ข้อมูลเกี่ยวกับอุปกรณ์อิเล็กทรอนิกส์ที่ท่านใช้ เช่น IP Address<br>
(3) ชนิดและเวอร์ชันของบราวเซอร์ที่ท่านใช้ รวมถึงชนิดและเวอร์ชันของ plug-in ของบราวเซอร์<br>
(4) การตั้งค่าเขตเวลา (Time zone)<br>
2.3 เราไม่มีการเก็บข้อมูลบัตรเครดิตของท่าน บริการด้านการชำระเงินเราใช้บริการจาก Omise โดยตรง<br>
2.4 ในกรณีที่จำเป็น เราจะประมวลผลข้อมูลส่วนบุคคลชนิดพิเศษของท่านโดยได้รับความยินยอมโดยชัดแจ้งจากท่านหรือเพื่อวัตถุประสงค์อื่นตามที่กฎหมายกำหนดไว้เท่านั้น ทั้งนี้ เราจะใช้ความพยายามอย่างดีที่สุดในการจัดให้มีมาตรการรักษาความปลอดภัยที่เพียงพอเพื่อปกป้องคุ้มครองข้อมูลส่วนบุคคลชนิดพิเศษของท่าน<br>
<br>
<h4>3. คุกกี้</h4>
3.1 คุกกี้ คือ ข้อมูลคอมพิวเตอร์ขนาดเล็ก (text file) ที่จะถูกติดตั้ง หรือบันทึกลงบนคอมพิวเตอร์หรืออุปกรณ์อิเล็กทรอนิกส์ของท่านเมื่อท่านเข้าชมเว็บไซต์ คุกกี้จะจดจำข้อมูลการใช้งานเว็บไซต์ของท่าน ทั้งนี้ เราจะเรียกเทคโนโลยีอื่นที่ทำหน้าที่คล้ายคลึงกันว่าคุกกี้ด้วย<br>
3.2 เว็บไซต์นี้ใช้คุกกี้ในการเก็บข้อมูลการใช้งาน เพื่อให้คุณได้รับประสบการณ์ที่ดี หากคุณใช้งานเว็บไซต์ต่อ เราถือว่าคุณยอมรับการใช้งานคุกกี้<br>
<br>
<h4>4. การขอความยินยอมและผลกระทบที่เป็นไปได้จากการถอนความยินยอม</h4>
4.1 ในกรณีที่เราเก็บรวบรวมและประมวลผลข้อมูลส่วนบุคคลโดยอาศัยความยินยอมของท่าน ท่านมีสิทธิที่จะถอนความยินยอมของท่านที่ให้ไว้กับเราได้ตลอดเวลา ซึ่งการถอนความยินยอมนี้จะไม่ส่งผลกระทบต่อการเก็บรวบรวม ใช้ เปิดเผย หรือประมวลผลข้อมูลส่วนบุคคลที่ท่านได้ให้ความยินยอมไปแล้ว<br>
4.2 หากท่านถอนความยินยอมที่ได้ให้ไว้กับเราหรือปฏิเสธไม่ให้ข้อมูลบางอย่าง อาจส่งผลให้เราไม่สามารถดำเนินการเพื่อบรรลุวัตถุประสงค์บางส่วนหรือทั้งหมดตามที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้ได้<br>
4.3 หากท่านมีอายุไม่ครบ 20 ปีบริบูรณ์ ก่อนการให้ความยินยอมโปรดแจ้งรายละเอียดผู้ใช้อำนาจปกครองให้เราทราบเพื่อให้เราสามารถดำเนินการขอความยินยอมจากผู้ใช้อำนาจปกครองด้วย<br>
<br>
<h4>5. ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล</h4>
5.1 เราจะเก็บข้อมูลส่วนบุคคลของท่านในระยะเวลาที่จำเป็นเพื่อให้บรรลุวัตถุประสงค์ตามประเภทข้อมูลส่วนบุคคลแต่ละประเภท เว้นแต่กฎหมายจะอนุญาตให้มีระยะเวลาการเก็บรักษาที่นานขึ้น ในกรณีที่ไม่สามารถระบุระยะเวลาการเก็บรักษาข้อมูลส่วนบุคคลได้ชัดเจน เราจะเก็บรักษาข้อมูลไว้ตามระยะเวลาที่อาจคาดหมายได้ตามมาตรฐานของการเก็บรวบรวม (เช่น อายุความตามกฎหมายทั่วไปสูงสุด 10 ปี)<br>
5.2 เราจัดให้มีระบบการตรวจสอบเพื่อดำเนินการลบหรือทำลายข้อมูลส่วนบุคคลเมื่อพ้นกำหนดระยะเวลาการเก็บรักษาหรือที่ไม่เกี่ยวข้องหรือเกินความจำเป็นตามวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคลนั้น<br>
5.3 กรณีที่เราใช้ข้อมูลส่วนบุคคลของท่านโดยขอความยินยอมจากท่าน เราจะประมวลผลข้อมูลส่วนบุคคลดังกล่าวจนกว่าท่านจะแจ้งขอยกเลิกความยินยอมและเราดำเนินการตามคำขอของท่านเสร็จสิ้นแล้ว อย่างไรก็ดี เราจะยังเก็บข้อมูลส่วนบุคคลของท่านเท่าที่จำเป็นสำหรับบันทึกเป็นประวัติว่าท่านเคยยกเลิกความยินยอม เพื่อให้ เราสามารถตอบสนองต่อคำขอของท่านในอนาคตได้<br>
<br>
<h4>6. การเปิดเผยข้อมูลส่วนบุคคลให้บุคคลอื่น</h4>
6.1 เราเปิดเผยและแบ่งปันข้อมูลส่วนบุคคลของท่านกับ<br>
(1) บุคคลและนิติบุคคลอื่นที่ไม่ได้เป็นบริษัทในกลุ่มของเรา ("บุคคลอื่น") เพื่อบรรลุวัตถุประสงค์การเก็บรวบรวมและประมวลผลข้อมูลส่วนบุคคลตามที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้ เช่น ผู้ให้บริการด้านการชำระเงิน (Omise) ผู้ให้บริการด้านบัญขี ผู้ให้บริการจัดทำโปรแกรมและระบบไอทีต่าง ๆ และบุคคลอื่นที่จำเป็นเพื่อให้เราสามารถดำเนินธุรกิจและให้บริการแก่ท่าน รวมถึงดำเนินการใด ๆ ตามวัตถุประสงค์การเก็บรวบรวมและประมวลผลข้อมูลส่วนบุคคลตามที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้<br>
6.2 เราจะกำหนดให้ผู้ที่ได้รับข้อมูลมีมาตรการปกป้องข้อมูลของท่านอย่างเหมาะสมและประมวลผลข้อมูลส่วนบุคคลดังกล่าวเท่าที่จำเป็นเท่านั้น และดำเนินการเพื่อป้องกันไม่ให้ใช้หรือเปิดเผยข้อมูลส่วนบุคคลโดยปราศจากอำนาจโดยมิชอบ<br>
<br>
<h4>7. มาตรการความปลอดภัยสำหรับข้อมูลส่วนบุคคล</h4>
7.1 ความปลอดภัยของข้อมูลส่วนบุคคลของท่านเป็นสิ่งสำคัญสำหรับเราและเราได้นำมาตรฐานความปลอดภัยทางเทคนิคและการบริหารที่เหมาะสมมาใช้เพื่อปกป้องข้อมูลส่วนบุคคลจากการสูญหาย การเข้าถึงการใช้หรือการเปิดเผยโดยไม่ได้รับอนุญาต การใช้งานในทางที่ผิด การดัดแปลงเปลี่ยนแปลง และการทำลายโดยใช้เทคโนโลยีและขั้นตอนการรักษาความปลอดภัย เช่น การเข้ารหัสและการจำกัดการเข้าถึง เพื่อให้มั่นใจว่าบุคคลที่ได้รับอนุญาตเท่านั้นที่เข้าถึงข้อมูลส่วนบุคคลของท่านและบุคคลเหล่านี้ได้รับการฝึกอบรมเกี่ยวกับความสำคัญของการปกป้องข้อมูลส่วนบุคคล<br>
7.2 เราจัดให้มีมาตรการรักษาความปลอดภัยที่เหมาะสม เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข เปิดเผยข้อมูลส่วนบุคคลจากผู้ที่ไม่มีสิทธิหรือหน้าที่ที่เกี่ยวข้องกับข้อมูลส่วนบุคคลนั้น และจะจัดให้มีการทบทวนมาตรการดังกล่าวเมื่อมีความจำเป็นหรือเมื่อเทคโนโลยีเปลี่ยนแปลงไปเพื่อให้มีประสิทธิภาพในการรักษาความปลอดภัยที่เหมาะสม<br>
<br>
<h4>8. สิทธิเกี่ยวกับข้อมูลส่วนบุคคลของท่าน</h4>
8.1 ท่านมีสิทธิตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล สรุปดังนี้<br>
(1) ถอนความยินยอมที่ท่านได้ให้ไว้กับเรา เพื่อประมวลผลข้อมูลส่วนบุคคลของท่าน<br>
(2) ขอดูและคัดลอกข้อมูลส่วนบุคคลของท่าน หรือขอให้เปิดเผยที่มาของข้อมูลส่วนบุคคลของท่าน<br>
(3) ส่งหรือโอนข้อมูลส่วนบุคคลที่อยู่ในรูปแบบอิเล็กทรอนิกส์ตามที่กฎหมายคุ้มครองข้อมูลส่วนบุคคลกำหนดไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่น<br>
(4) คัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลที่เกี่ยวกับท่าน<br>
(5) ลบหรือทำลาย หรือทำให้ข้อมูลส่วนบุคคลของท่านเป็นข้อมูลที่ไม่สามารถระบุตัวตนของท่านได้ (anonymous)<br>
(6) ระงับการใช้ข้อมูลส่วนบุคคลของท่าน<br>
(7) แก้ไขข้อมูลส่วนบุคคลของท่านให้ถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด<br>
<br>
<h4>9. ข้อมูลเกี่ยวกับผู้ควบคุมข้อมูลส่วนบุคคลและเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล</h4>
9.1 ผู้ควบคุมข้อมูลส่วนบุคคล: บริษัท บีแทสก์ คอนซัลติ้ง จำกัด สถานที่ติดต่อ: เลขที่ 345 หมู่ที่ 3 ตำบลบ้านใหม่ อำเภอปากเกร็ด จังหวัดนนทบุรี 11120<br>
9.2 กรณีที่ท่านมีข้อสอบถามเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล โปรดติดต่อเบอร์ 02-584-7060 หรือ e-mail: support@betaskthai.com<br>
<br>
กรณีที่มีการแก้ไขเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้ เราจะประกาศนโยบายความเป็นส่วนตัวฉบับใหม่ผ่านทางเว็บไซต์นี้ ซึ่งท่านควรเข้ามาตรวจสอบความเปลี่ยนแปลงนโยบายความเป็นส่วนตัวเป็นครั้งคราว โดยนโยบายความเป็นส่วนตัวฉบับใหม่จะมีผลบังคับใช้ทันทีในวันที่ประกาศ<br>
      </v-container>
    </v-main>
  </div>
</template>
<script>
export default {
  name: 'PrivacyNotice'
}
</script>
